Aula4/rails-estagio/app/controllers/usuario_controller.rb

SELECT * FROM "usuario" ORDER BY id
---
  def index
  	#render :text => "LISTA DE USUARIOS"
  	@lista = Usuario.all(:order => "id") # ordena por id

INSERT INTO "usuario" ("nome", "data_nascimento", "arquivado", "created_at", "updated_at", "observacao") VALUES('Suely', '1950-07-30', 'f', '2015-10-06 18:15:46.888122', '2015-10-06 18:15:46.888122', 'mãe do rodrigo') RETURNING "id"
---
  def save
#  	render :text => "save..."
  	@usuario = Usuario.new
  	@usuario.nome = params[:nome]
  	@usuario.observacao = params[:observacao]
  	@usuario.data_nascimento = params[:data_nascimento]
  	@usuario.save!

SELECT * FROM "usuario" WHERE ("usuario"."id" = 5)
---
  def editar # html
  	@usuario = Usuario.find(params[:id])

SELECT * FROM "usuario" WHERE ("usuario"."id" = 5)
UPDATE "usuario" SET "observacao" = 'aluno teste', "data_nascimento" = NULL, "updated_at" = '2015-10-06 18:04:46.646778' WHERE "id" = 5
---
  def update
  	@usuario = Usuario.find(params[:id])
  	@usuario.nome = params[:nome]
  	@usuario.observacao = params[:observacao]
  	@usuario.data_nascimento = params[:data_nascimento]
  	@usuario.save!

SELECT * FROM "usuario" WHERE ("usuario"."id" = 4)
DELETE FROM "usuario" WHERE ("id" IN (4))
---
  def delete
  	#render :text => "delete..."
  	id = params[:id] # captura o id
  	u = Usuario.find(id)
  	u.delete # não precisa do método save

SELECT * FROM "usuario" WHERE (nome like '%lu%') ORDER BY nome
---
  def query
 	@lista = Usuario.all(:conditions => ["nome like ?", '%' + params[:nome] + '%'], :order => "nome")